#논리: 맞는지 틀린지 판다
#연산자:
    #산술연산자: +더하기, -빼기, *곱하기, /나누기, //나누기[몫], %나누기[나머지]
    #비교연산자: >초가, <미만, >=이상, <=이하, ==같다, !=같지않다
    #논리연산자: and[이면서], or[이거나], ![부정]
    #대입연산자: =[오른쪽값을 왼쪽에 대입]
                # +=[오른쪽값을 왼쪽값에 더하기 후 왼쪽값에 대임]
                # -=[오른쪽값을 왼쪽값에 뺴기 후 왼쪽값에 대입]
                # *= /= %= 등


    #if :논리문

    #       if 논리:
    #            참[코드]
    #       else:
    #           거짓[코드]


    #if 논리:
    #   참[코드]
    #if 논리2:
    #   참2[코드2]
    #if 논리3:
    #   참3[코드3]
    #else:
    #   거짓[코드]

    #if 논리:
    #   참[코드]
    #if 논리2:
    #   참2[코드2]
    #if 논리3:
    #   참3[코드3]

        #if 논리:                   if 학년=3:
        #     if 논리:                    if 성별=남:
        #         참[코드]                     학년이 3 이면서 남학생
        #    else:                       else:
        #        거짓[코드]                   학년이 3 이면서 여학생
        #else:                        else:
        #    if 논리:                       if 성별=남:
        #           참[코드]                     3학년이 아니면서 남학생
        #      else:                        else:
        #           거짓[코드]                   3학년이 아니면서 여학생


#문제101: type(): 데이터의 타임[형태] 확인해주는 함수
print(type(True)) #bool: 참[True] 거짓[False] 둘중 하나 저장하는 타입
print(type(False)) #bool: 참[True] 거짓[False] 둘중 하나 저장하는 타입

#102.
#False

#103.
#True

#104.
#True

#105.
#True

#106.
#이유: 같거나 초과 기호는 없음// 초과나 같다 >=[이상]

#107.
#출력없음

#108.
#Hi, there.

#109.
#1
#2
#4

#110.
#3
#5







