#1.for 변수 in 리스트명:
#2.for 변수 range(시작값,끝값,증가단위):

#171.
price_list=[32100,32150,32000,32500]
for 변수 in price_list:
    print(변수)
for i in range(4):
    print(price_list[i])

#172.
가격목록=[32100,32150,32000,32500]
for i,변수 in enumerate(가격목록):
    print(i,변수)

#173.
가격목록=[32100,32150,32000,32500]
for i in range(len(가격목록)):
    print(3-i,가격목록[i])

#174.
가격목록=[32100,32150,32000,32500]
for i in range(1,4): #0인덱스 제외
    print(90+10*i,가격목록[i])

#175.
내목록=["가","나","다","라"]
#############반복문 없이 풀기#########
print(내목록[0],내목록[1])
print(내목록[1],내목록[2])
print(내목록[2],내목록[3])
###############반복문으로 풀기##########
for i in range(1,4):
    print(내목록[i-1],내목록[i])

#176.
내목록=["가","나","다","라","마"]
print(내목록[0],내목록[1],내목록[2])
print(내목록[1],내목록[2],내목록[3])
print(내목록[2],내목록[3],내목록[4])
for i in range(2,5):
    print(내목록[i-2],내목록[i-1],내목록[i])

#177.
내목록=["가","나","다","라"]
print(내목록[3],내목록[2])
print(내목록[2],내목록[1])
print(내목록[1],내목록[0])
for i in range(3,2,1):
    print(내목록[i],내목록[i-1])

#178.
내목록=[100,200,400,800]
print(내목록[1]-내목록[0])
print(내목록[2]-내목록[1])
print(내목록[3]-내목록[2])
for i in range(3):
    print(내목록[i+1]-내목록[i])

#179.
내목록=[100,200,400,800,1000,1300]
print((내목록[0]+내목록[1]+내목록[2])/3)
print((내목록[1]+내목록[2]+내목록[3])/3)
print((내목록[2]+내목록[3]+내목록[4])/3)
print((내목록[3]+내목록[4]+내목록[5])/3)

for i in range(4):
    print((내목록[i]+내목록[i+1]+내목록[i+2]/3))

#180.
저가=[100,200,400,800,1000]
고가=[150,300,430,880,1000]
저장리스트=[]
for i in range(5):
    저장리스트.append(고가[i]-저가[i])

    #2차원 리스트: [ [1차원] , [1차원] , [1차원] ]
    #행:가로
    #열:세로
    #딕셔너리:키와 값으로 이루어진 한쌍=>여러개 저장하는 공간{  }

#181.
아파트=[["101호","102호"],["201호","202호"],["301호","302호"]]

#182.
스톡=[["시가",100,200,300],["종가",80,210,330]]

#183.
스톡={"시가":[100,200,300],"종가":[80,210,330]}

#184.
스톡={"10/10":[80,110,70,90],"10/11":[210,230,190,200]}

#185.
apart=[[101,102],[201,202],[301,302]]
    #행:3개       #열:행마다 2개
for 행 in apart:
    for 열 in 행:
        print(열,"호")

#186.
apart=[[101,102],[201,202],[301,302]]
for 행 in apart[::-1]:
    for 열 in 행:
        print(열,"호")

#187.
apart=[[101,102],[201,202],[301,302]]
for 행 in apart[: :-1]:
    for 열 in 행[ : :-1]:
        print(열,"호")

#188.
for 행 in apart:
    for 열 in 행:
        print(열,"호")
        print("-------")

#189.
apart=[[101,102],[201,202],[301,302]]
for 행 in apart:
    for 열 in 행:
        print(열,"호")
    print("-------")

#190.
for 행 in apart:
    for 열 in 행:
        print(열,"호")
print("-----")

#191.
data=[[2000,3050,2050,1980],[7500,2050,2050,1980],[15450,15050,15550,14900]]
for 행 in data:
    for 열 in 행:
        print(열*1.00014)
        #1:100%  0.5:5%    0.00014:0.014%

#192.
for 행 in data:
    for 열 in 행:
        print(열*1.00014)
    print("-"*5)    #행마다 출력

#193.#결과를 1차원 리스트에 저장
결과=[]
for 행 in data:
    for 열 in 행:
        결과.append(열*1.00014)#하나씩 리스트에 저장
print(결과)

#194.#결과를 2차원 리스트에 저장
결과=[]#2차원 리스트에 사용될 예정
for 행 in data:
    sub=[] #행 리스트
    for 열 in 행:
        sub.append(열*1.00014)
    결과.append(sub)
print(결과)

#195.
ohlc=[["open","high","low","close"],[100,110,70,100],[200,210,180,190],[300,310,300,310]]
for 행 in ohlc[1: ]: #0번 행 제외
    print(행[3])#각 행마다 4번 인덱스 출력

#196.
ohlc=[["open","high","low","close"],[100,110,70,100],[200,210,180,190],[300,310,300,310]]
for 행 in ohlc[1 : ]:
    if 행[3] > 150: #각 행마다 3번 인덱스 값이 150보다 크면
        print(행[3]) #각 행마다 3번 인덱스 출력

#197.
for 행 in ohlc[1: ]:
    if 행[3] >= 행[0]: #3번 인덱스가 0번인덱스보다 이상이면
        print(행[3]) #각 행마다 3번 인덱스 출력

#198.
변등폭=[]
for 행 in ohlc[1 : ]: #0번 행 제외
    변등폭.append(행[1]-행[2])
                #고가-저가
print(변등폭)

#199
for 행 in ohlc:
    if 행[3] > 행[0]: #종가가 시가보다 크면
        print(행[1]-행[2]) #변등폭 계산

#200.
총수익금=0
for 행 in ohlc[1 : ]: #0번 행 제외
    총수익금+=(행[3]-행[0]) #종가-시가 => 수익 => +총수익금
print(총수익금)