#91.
인벤토리={"메로나":[300,20],"비비빅":[400,3],"죠스바":[250,100]}

#92.
인벤토리={"메로나":[300,20],"비비빅":[400,3],"죠스바":[250,100]}
print(인벤토리["메로나"][0])

#93.
인벤토리={"메로나":[300,20],"비비빅":[400,3],"죠스바":[250,100]}
print(인벤토리["메로나"][1])

#94.
인벤토리={"메로나":[300,20],"비비빅":[400,3],"죠스바":[250,100]}
인벤토리["월드콘"]=[500,7]
print(인벤토리)

#95.
아이스크림={"탱크보이":1200,"폴라포":1200,"빵빠레":1800,"월드콘":1500,"메로나":1000}
print(list(아이스크림.keys()))

#96.
아이스크림={"탱크보이":1200,"폴라포":1200,"빵빠레":1800,"월드콘":1500,"메로나":1000}
print(list(아이스크림.values()))
#97.#values()로 가격을 불러오고 sum으로 합한다
아이스크림={"탱크보이":1200,"폴라포":1200,"빵빠레":1800,"월드콘":1500,"메로나":1000}
합=sum(아이스크림.values())
print(합)

#98
아이스크림={"탱크보이":1200,"폴라포":1200,"빵빠레":1800,"월드콘":1500,"메로나":1000}
new_product={"팥빙수":2700,"아맛나":1000}
아이스크림.update(new_product)#딕셔너리명1.update(딕셔너리명2)

#99. #zip()함수는 두개의 자료를 묶어준다
keys=("apple","pear","peach")
vals=(300,500,400)
result=dict(zip(keys,vals))
print(result)

#100
date=["09/05","09,06","09/07","09/07","09/08","09/09"]
close_price=["10500,10300,10100,10800,11000"]
close_table=dict(zip(date,close_price))
print(close_table)
